docs/benchmarks/serving-20260912/serial.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fde80ef7100>, trust_remote_code=False, seed=20260912, num_prompts=16, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=128, random_output_len=16, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:18022', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='ByteDance/Ouro-1.4B', input_len=None, output_len=None, tokenizer='/data/hsliu2/tmp/vllm-lt-models/ouro-1.4b', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/data/hsliu2/tmp/vllm-lt-openai-serving/artifacts/serving/run-1', result_filename='serial.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-3886521f-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body={'temperature': 0, 'seed': 0, 'min_loops': 2, 'max_loops': 4, 'exit_threshold': 1.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
ERROR 09-12 15:42:52 [repo_utils.py:106] Error parsing config for /data/hsliu2/tmp/vllm-lt-models/ouro-1.4b: The repository /data/hsliu2/tmp/vllm-lt-models/ouro-1.4b contains custom code which must be executed to correctly load the model. You can inspect the repository content at /data/hsliu2/tmp/vllm-lt-models/ouro-1.4b .
ERROR 09-12 15:42:52 [repo_utils.py:106]  You can inspect the repository content at https://hf.co//data/hsliu2/tmp/vllm-lt-models/ouro-1.4b.
ERROR 09-12 15:42:52 [repo_utils.py:106] Please pass the argument `trust_remote_code=True` to allow custom code to be run., retrying 1 of 2
ERROR 09-12 15:42:54 [repo_utils.py:104] Error parsing config for /data/hsliu2/tmp/vllm-lt-models/ouro-1.4b: The repository /data/hsliu2/tmp/vllm-lt-models/ouro-1.4b contains custom code which must be executed to correctly load the model. You can inspect the repository content at /data/hsliu2/tmp/vllm-lt-models/ouro-1.4b .
ERROR 09-12 15:42:54 [repo_utils.py:104]  You can inspect the repository content at https://hf.co//data/hsliu2/tmp/vllm-lt-models/ouro-1.4b.
ERROR 09-12 15:42:54 [repo_utils.py:104] Please pass the argument `trust_remote_code=True` to allow custom code to be run.
[transformers] You are using a model of type `ouro` to instantiate a model of type ``. This may be expected if you are loading a checkpoint that shares a subset of the architecture (e.g., loading a `sam2_video` checkpoint into `Sam2Model`), but is otherwise not supported and can yield errors. Please verify that the checkpoint is compatible with the model you are instantiating.
INFO 09-12 15:42:54 [utils.py:90] Sampling input_len from [128, 128] and output_len from [16, 16]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     16        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  19.03     
Total input tokens:                      2048      
Total generated tokens:                  256       
Request throughput (req/s):              0.84      
Output token throughput (tok/s):         13.45     
Peak output token throughput (tok/s):    15.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          121.08    
---------------Time to First Token----------------
Mean TTFT (ms):                          135.33    
Median TTFT (ms):                        115.32    
P50 TTFT (ms):                           115.32    
P90 TTFT (ms):                           118.82    
P99 TTFT (ms):                           384.16    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          70.25     
Median TPOT (ms):                        70.09     
P50 TPOT (ms):                           70.09     
P90 TPOT (ms):                           71.19     
P99 TPOT (ms):                           72.35     
---------------Inter-token Latency----------------
Mean ITL (ms):                           70.25     
Median ITL (ms):                         69.89     
P50 ITL (ms):                            69.89     
P90 ITL (ms):                            71.47     
P99 ITL (ms):                            75.96     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1189.05   
Median E2EL (ms):                        1167.04   
P50 E2EL (ms):                           1167.04   
P90 E2EL (ms):                           1183.44   
P99 E2EL (ms):                           1469.12   
==================================================